### Rename Multiple Pandas Dataframe Column Names At Once

In [1]:
import pandas as pd

pd.set_option('display.max_row',1000)

pd.set_option('display.max_columns',50)

In [4]:
data = {'Commander':['Jason','Molly','Tina','Jake','Amy'],
        'Date':['2012, 02, 08', '2012, 02, 08','2012, 02, 08','2012, 02, 08','2012, 02, 08'],
        'Score':[4,24,31,2,3]}
df = pd.DataFrame(data, index=['Cochise','Pima', 'Santa Cruz','Maricopa','Yuma'])
df

           Commander          Date  Score
Cochise        Jason  2012, 02, 08      4
Pima           Molly  2012, 02, 08     24
Santa Cruz      Tina  2012, 02, 08     31
Maricopa        Jake  2012, 02, 08      2
Yuma             Amy  2012, 02, 08      3

In [5]:
df.columns = ['Leader','Time','Score']

In [6]:
df

           Leader          Time  Score
Cochise     Jason  2012, 02, 08      4
Pima        Molly  2012, 02, 08     24
Santa Cruz   Tina  2012, 02, 08     31
Maricopa     Jake  2012, 02, 08      2
Yuma          Amy  2012, 02, 08      3

In [7]:
df.rename({'Leader':'Commander'},inplace=True)

In [8]:
df

           Leader          Time  Score
Cochise     Jason  2012, 02, 08      4
Pima        Molly  2012, 02, 08     24
Santa Cruz   Tina  2012, 02, 08     31
Maricopa     Jake  2012, 02, 08      2
Yuma          Amy  2012, 02, 08      3